# FROM говорит, какой мы образ используем, в данном слечае официальный от golang с определенной версией.
# Образов пруд пруди, найти их не состовляет сложности,
# тем более собранных докерфайлов на все случаи жизни можно найти с примерами проектов.
# Можете на это смотреть, как на установку гошки на виртуальную машину
FROM golang:1.23.4

# WORKDIR говорит, куда мы будем работать, т.е. куда будем копировать файлы.
# В данном случае мы работаем в папке /usr/src/app, т.е. в папку /usr/src/app (логично? логично)
# Почему эта папка? Контейнеры работают на базе линукс, где в /usr/src находятся исходные тексты программ,
# установленных в системе. app/ - уже кастомная папка, в которой мы будем хранить наши файлы
# (не забывайте, что это все внутри докера, физически на компе храните свой проект где душе угодно)
WORKDIR /usr/src/app

# RUN говорит, что мы будем выполнять команду(после RUN идет bash команда, которую хотите заюзать).
# В данном случае установка air - это гошная приколюха, которая позволяет рекомпилировать проект в рантайме.
# Не нужно ребилдить докер, чтобы увидеть изменения (подробнее читай про live-reloading и не путай с hot-reloading)
RUN go install github.com/air-verse/air@latest


COPY . .
COPY .air.toml .air.toml

RUN go mod tidy
